import React from 'react';

// components
import Banner from "./banner"
import Courses from './Courses';

//css
import Style from "./home.module.css"

const Home = () => {

        return (
            <div>
                <Banner/>
                <Courses/>
                <div className={Style.main}>
                    <h1>Front end چیست؟</h1>
                    <p>
                    فرانت اند یا Front End، به بخش قابل مشاهده‌ی یک وب سایت یا نرم افزار توسط کاربران می‌گویند. فرانت اند، کدهای غیر قابل فهم برای کاربران را در قالب ظاهری گرافیکی و بصری به آن‌ها نمایش می‌دهد تا بتوانند به راحتی از بخش‌های مختلف سایت استفاده کنند. در این بخش، فرم‌های ورودی اطلاعات، صداها، تصاویر، ویدئوها و
                     به صورت کلی هر چیز دیگری که برای کاربر قابل درک باشد، قرار می‌گیرد.
                    فرانت اند به دو بخش اصلی طراحی و توسعه رابط کاربری تقسیم می‌شود. در ب
                    خش طراحی، طراحان با نرم افزارهای گرافیکی مانند فتوشاپ، ادوبی ایکس دی، فیگما و… ظاهر سایت
                    را طراحی می‌کنند. اما بخش توسعه‌ی رابط کاربری مربوط به پیاده سازی ظاهر سایت در قالب کدهای
                    HTML ،CSS و جاو
                    ا اسکریپت است. بخش قابل مشاهده‌ سایت برای کاربران در سمت فرانت را سمت کاربر یا Client Side می‌نامند. بنابراین کدهای نوشته شده
                    در سمت فرانت اند، در مرورگر کاربر پردازش و اجرا می‌شوند. یعنی کاربر به ر
                    احتی به این کدها دسترسی مستقیم دارد و می‌تواند آن‌ها را مشاهده کند. فرانت اند با بخش بک اند (
                        Backend) در ارتباط مستقیم است و بر روی تجربه کاربران هنگام استفاده از محصول تاثیر بسیاری می‌گذارد.
                    </p>
                </div>
            </div>
        );
    }

export default Home;